In [2]:
import numpy as np
import pandas as pd

In [3]:
df1 = pd.DataFrame({'A':[1, 2, 3, 4], 'B':[5, 6, 7, 8], 'C':[9, 10, 11, 12]}, index=['r1', 'r2', 'r3', 'r4'])

In [4]:
df1

    A  B   C
r1  1  5   9
r2  2  6  10
r3  3  7  11
r4  4  8  12

In [5]:
df1.columns = ['col1', 'col2', 'col3']

In [6]:
df1

    col1  col2  col3
r1     1     5     9
r2     2     6    10
r3     3     7    11
r4     4     8    12

In [12]:
print(type(df1['col1']))
df1['col1']

<class 'pandas.core.series.Series'>

r1    1
r2    2
r3    3
r4    4
Name: col1, dtype: int64

In [13]:
print(type(df1[['col1']]))
df1[['col1']]

<class 'pandas.core.frame.DataFrame'>

    col1
r1     1
r2     2
r3     3
r4     4

In [14]:
df1[['col1','col2']]

    col1  col2
r1     1     5
r2     2     6
r3     3     7
r4     4     8

Select Row

In [17]:
df1[0:0]

Empty DataFrame
Columns: [col1, col2, col3]
Index: []

In [16]:
df1[0:1]

    col1  col2  col3
r1     1     5     9

In [19]:
df1['r1':'r2']

    col1  col2  col3
r1     1     5     9
r2     2     6    10

In [21]:
df1['r1':'r3':2] # begin end step

    col1  col2  col3
r1     1     5     9
r3     3     7    11

In [22]:
df1[df1['col1'] > 2]

    col1  col2  col3
r3     3     7    11
r4     4     8    12

In [23]:
df1[(df1['col1'] > 2) & (df1['col3'] > 9)]

    col1  col2  col3
r3     3     7    11
r4     4     8    12

In [24]:
df1[1:4][0:2][['col2', 'col3']][df1['col3'] > 9.0]

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

    col2  col3
r2     6    10
r3     7    11

In [25]:
df1

    col1  col2  col3
r1     1     5     9
r2     2     6    10
r3     3     7    11
r4     4     8    12

In [27]:
df1.loc['r1':'r3','col1']

r1    1
r2    2
r3    3
Name: col1, dtype: int64

In [28]:
df1.loc['r1':'r3',['col1']]

    col1
r1     1
r2     2
r3     3

In [29]:
df1.loc['r1':'r3',['col1','col2']]

    col1  col2
r1     1     5
r2     2     6
r3     3     7

In [44]:
df1.iloc[0:3,0:3]  # row , column

    col1  col2  col3
r1     1     5     9
r2     2     6    10
r3     3     7    11

In [37]:
df1.ix[0:4, ['col1']]

    col1
r1     1
r2     2
r3     3
r4     4

In [38]:
df1.at['r2','col1']

2

In [40]:
df1.iat[1,0]

2

In [45]:
df1

    col1  col2  col3
r1     1     5     9
r2     2     6    10
r3     3     7    11
r4     4     8    12

In [46]:
df1['col1']=9

In [48]:
df1

    col1  col2  col3
r1     9     5     9
r2     9     6    10
r3     9     7    11
r4     9     8    12

In [49]:
df1.loc['r2',:] = 8

In [50]:
df1

    col1  col2  col3
r1     9     5     9
r2     8     8     8
r3     9     7    11
r4     9     8    12

In [56]:
df1.iloc[2:4,1:3] = 77

In [55]:
df1

    col1  col2  col3
r1     9     5     9
r2     8     8     8
r3     9    77    99
r4     9    77    99

In [57]:
df1_view = df1.loc[df1.col1 > 2]

In [58]:
df1

    col1  col2  col3
r1     9     5     9
r2     8     8     8
r3     9    77    77
r4     9    77    77

In [59]:
df1_view

    col1  col2  col3
r1     9     5     9
r2     8     8     8
r3     9    77    77
r4     9    77    77

In [60]:
df1_view.loc['r3':'r4', 'col1'] = 55

In [61]:
df1_view

    col1  col2  col3
r1     9     5     9
r2     8     8     8
r3    55    77    77
r4    55    77    77

In [62]:
df1_copy = df1.loc[df1.col1 > 2].copy()

In [63]:
df1_copy

    col1  col2  col3
r1     9     5     9
r2     8     8     8
r3     9    77    77
r4     9    77    77

Datasets: Loads an iris dataset from scikit-learn library

In [69]:
import pandas as pd
from sklearn import datasets
# Load iris dataset
iris = datasets.load_iris()
# Convert iris datasets to Pandas DataFrame object
df = pd.DataFrame(iris['data'], columns=iris['feature_names'])

In [70]:
df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [72]:
df['target'] = iris['target']
df.head()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0
2,4.7,3.2,1.3,0.2,0
3,4.6,3.1,1.5,0.2,0
4,5.0,3.6,1.4,0.2,0

In [73]:
df.columns

Index(['sepal length (cm)', 'sepal width (cm)', 'petal length (cm)',
       'petal width (cm)', 'target'],
      dtype='object')

In [74]:
dat1 = df[0:2]
dat1

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,5.1,3.5,1.4,0.2,0
1,4.9,3.0,1.4,0.2,0

### Actual v View Data

In [86]:
#dat2 = dat1[dat1['sepal length (cm)']>5]['target'] = 9

#dat2 = dat1[dat1['sepal length (cm)']>5]['target'] = 9

In [101]:
dat1 = df[0:2].copy()

In [105]:
dat1.loc[dat1['sepal length (cm)']>5,'target'] = 9

In [106]:
#dat1['target'] = 0
dat1

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,5.1,3.5,1.4,0.2,9
1,4.9,3.0,1.4,0.2,0

In [96]:
dat2 = dat1.loc[dat1['sepal length (cm)']>5,'target'] = 9

In [97]:
dat2

9

In [100]:
dat1.is_copy

In [107]:
df.is_copy

 By Value vs. By Reference